from telebot import types
class Eat():
    def __init__(self, name, cost, ttype):
        self.name = name
        self.cost = cost
        self.type = ttype

    def to_s(self):
        s = self.name + " - " + str(self.cost) + "тг"
        return s

class Menu:
    def __init__(self):
       self.MyMenu = []

    def add_in_Menu(self, item):
        self.MyMenu.append(item)

    def it_menu(self, ttype):
        all=[]
        #dict = {}
        for eat in self.MyMenu:
            if eat.type == ttype:
                all.append(types.KeyboardButton(eat.to_s()))
            #dict.update(types.KeyboardButton(eat.to_s()))
        return all
    def all_menu(self):
        all=[]
        #dict = {}
        for eat in self.MyMenu:
            all.append(types.KeyboardButton(eat.to_s()))
            #dict.update(types.KeyboardButton(eat.to_s()))
        return all
menuTypes = ['Сеты', 'Роллы', 'Пицца', 'Донер', 'Бургеры', 'Салаты', 'Напитки', 'Комбо', 'Дополнительно']

eats = []
eats =  [Eat("сет 'Милан' ", 5250, "Сеты"), Eat("сет 'Love is' ", 5000, "Сеты"),
            Eat("сет 'Премиум' ", 10000, "Сеты"), Eat("сет 'Дубай' ", 5500, "Сеты"), Eat("роллы с кунжутом: 10шт", 1000, "Роллы"),
            Eat("сет 'Аризона' ", 2500, "Сеты"), Eat("овощной ролл: 10шт", 1000, "Роллы"), Eat("филодельфия: 10шт", 1200, "Роллы"),
            Eat("сет 'Симфония' ", 4000, "Сеты"), Eat("калифорния: 10шт", 1000, "Роллы"), Eat("филодельфия  классик: 10шт", 1200, "Роллы"),
            Eat("Царь. Жареные роллы: 10шт", 1000, "Роллы"), Eat("Цезарь: 10шт", 1200, "Роллы"),Eat("зеленый дракон: 10шт", 1000, "Роллы"),
            Eat("Американо: 10шт", 1200, "Роллы"),Eat("Роллы с угрем: 10шт", 1000, "Роллы"),Eat("Роллы с креветками: 10шт", 1200, "Роллы"),
            Eat("Фудинг фирменный ", 1800, "Пицца"),  Eat("Болоньезе ", 1600, "Пицца"),
            Eat("Пепперони ", 1600, "Пицца"), Eat("Маргарита ", 1500, "Пицца"), Eat("4 сезона", 1600, "Пицца"),

            Eat("Полный ", 700, "Донер"), Eat("Половина ", 400, "Донер"), Eat("Цезарь ролл ", 900, "Донер"),
            Eat("Фудинг ", 1000, "Бургеры"),
            Eat("Цезарь ", 600, "Салаты"), Eat("Греческий ", 650, "Салаты"),
            Eat("Пекинский ", 700, "Салаты"), Eat("Турецкий айран ", 250, "Напитки"), Eat("Cola 0.5л ", 250, "Напитки"),
            Eat("Cola 1л", 350, "Напитки"), Eat("Fuse tea 0.5л ", 250, "Напитки"), Eat("Fuse tea 1л ", 350, "Напитки"),
            Eat("Piko ябл. труб.", 200, "Напитки"), Eat("Кофе ", 100, "Напитки"), Eat("Чай ", 100, "Напитки"),
            Eat("Мини торт", 350, "К чаю"), Eat("Панкейки", 250, "К чаю"), Eat("Красный бархат", 400, "К чаю"),
            Eat("Вупи пай", 400, "К чаю"), Eat("Молочная девочка", 400, "К чаю"), Eat("Шоколад Казахстан", 450, "К чаю"),
            Eat("Панкейки", 250, "К чаю"),

            Eat("Комбо 1 ", 1200, "Комбо"), Eat("Комбо 2 ", 1000, "Комбо"), Eat("Комбо 3 ", 8000, "Комбо"),
            Eat("Комбо 6 ", 5000, "Комбо"), Eat("Комбо 5 ", 2500, "Комбо"), Eat("Комбо 4 ", 5000, "Комбо"),
            Eat("Крылышки 5шт ", 600, "Дополнительно"), Eat("Крылышки с кляром 5шт ", 800, "Дополнительно"), Eat("Курица с кляром ", 800, "Дополнительно"),
            Eat("Фри ", 400, "Дополнительно"), Eat("Карт.дольки ", 500, "Дополнительно"), Eat("Наггетсы ", 550, "Дополнительно"),
            Eat("Сырные палочки ", 500, "Дополнительно"), Eat("Корн-дог 2шт ", 350, "Дополнительно")
        ]
myMenu = Menu()

for eat in eats:
    myMenu.add_in_Menu(eat)